In [1]:
import pandas as pd
import numpy as np
import json

In [2]:
with open('data/district.json') as f:
    data = json.load(f)

In [3]:
print(data.keys())

dict_keys(['benchmarks', 'schools', 'courseSections', 'courseSectionRosters', 'scores'])

In [7]:
df_benchmarks = pd.DataFrame(data['benchmarks'])
df_schools = pd.DataFrame(data['schools'])
df_courseSections = pd.DataFrame(data['courseSections'])
df_courseSectionRosters = pd.DataFrame(data['courseSectionRosters'])
df_scores = pd.DataFrame(data['scores'])

In [6]:
df_benchmarks.head()

    id districtId  year level             dataSource value
0  120         45  2017     3     value_scantronMath  2356
1  121         45  2017     3  value_scantronReading  2563
2  122         45  2017     4     value_scantronMath  2493
3  123         45  2017     4  value_scantronReading  2674
4  124         45  2017     5     value_scantronMath  2584

In [17]:
df_benchmarks['districtId'].unique()

array(['45'], dtype=object)

In [8]:
df_schools.head()

,id,name,districtId,costCenter,abbreviation,acqRequestSelectable,oneRoster_sourcedId,oneRoster_ticketId
0,222,Elementary A,45,5,EES,1,,0
1,223,Middle School A,45,8,EMS,1,,0
2,224,High School A,45,10,ECHS,1,,0
3,225,Junior High B,45,12,ECJH,1,,0
4,226,Elementary School B,45,18,HES,1,,0

In [9]:
df_courseSections.head()

      id    vanityId  year schoolId
0  40388        PE 4  2015      222
1  40389   READING 4  2015      222
2  40390   HmroomPK6  2015      222
3  40391  LANGUAGE 4  2015      222
4  40392   SCIENCE 4  2015      222

In [10]:
df_courseSectionRosters.head()

        id courseSectionId studentId studentLevel ticket
0  1047696           39975     45333            4
1  1047704           39975     56116            4
2  1047706           39975     45345            4
3  1047715           39975     45400            4
4  1047729           39975     45413            4

In [11]:
df_scores.head()

,id,ticket,studentId,studentLevel,year,measurementTypeId,subgroup_specialEd,subgroup_lunchStatus,subgroup_gender,subgroup_ethnicity,...,value_starReading,value_starMath,value_ScienceMilestones,value_LEAPScience,value_SocialMilestones,value_gcaInfo,value_gcaNar,value_gcaOpin,value_aimsWebMath,value_aimsWebReading
0,115316,1530793427me3n202dz2,44774,8,2017,4,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,120482,1530793766nnbvcr456s,44774,8,2017,6,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,394052,1561150944dlvii7ak6r,44774,9,2018,6,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,115317,1530793427me3n202dz2,44775,8,2017,4,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,120483,1530793766nnbvcr456s,44775,8,2017,6,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [12]:
df_scores.columns

Index(['id', 'ticket', 'studentId', 'studentLevel', 'year',
       'measurementTypeId', 'subgroup_specialEd', 'subgroup_lunchStatus',
       'subgroup_gender', 'subgroup_ethnicity', 'subgroup_ell',
       'subgroup_bottom25', 'value_actMathScore', 'value_actEnglishScore',
       'value_actReadingScore', 'value_actScienceScore',
       'value_actCompositeScore', 'value_nweaMath', 'value_nweaReading',
       'value_nweaEnglish', 'value_iReadyMath', 'value_iReadyReading',
       'value_actMasteryComposite', 'value_actMasteryReading',
       'value_actMasteryMath', 'value_actMasteryScience',
       'value_actMasteryEnglish', 'value_nweaELA', 'value_scantronMath',
       'value_scantronReading', 'value_mapMath', 'value_mapEnglish',
       'value_mapReading', 'value_mapRLA', 'value_scantronScience',
       'value_scantronLanguage', 'value_ReadingFoundations',
       'value_scantronAlgebra', 'value_eocMath', 'value_actELAScore',
       'value_mapScience', 'value_LeapELAScale', 'value_LeapMathScale',
       'value_LeapALScale', 'value_LeapE2Scale', 'value_LeapGmScale',
       'value_LeapBlScale', 'value_LeapE3Scale', 'value_LeapUsScale',
       'value_E1Scale', 'value_UsEsScale', 'value_accessReadingScale',
       'value_accessReadingProficiency', 'value_accessCompositeScale',
       'value_accesscompositeProficiency', 'value_dibelsReading',
       'value_mapHistory', 'value_LEAPSocSci', 'value_scantronGeometry',
       'value_MathMilestones', 'value_ELAMilestones', 'value_starReading',
       'value_starMath', 'value_ScienceMilestones', 'value_LEAPScience',
       'value_SocialMilestones', 'value_gcaInfo', 'value_gcaNar',
       'value_gcaOpin', 'value_aimsWebMath', 'value_aimsWebReading'],
      dtype='object')

In [13]:
df_scores.shape

(34317, 71)

In [16]:
df_scores['studentId'].nunique()

12211